case/flowSolidGrowth/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    left
    {
        type           zeroGradient;
        value          $internalField;
    }
    right
    {
        type           zeroGradient;
        value          $internalField;

    }
    bottom
    {
        type            zeroGradient;
        value           $internalField;
    }
    top
    {
        type            fixedValue;
        value           uniform 300;
    }
    front
    {
        type           zeroGradient;
	value	       $internalField;
    }
    back
    {
        type           zeroGradient;
	value	       $internalField;
    }

}

// ************************************************************************* //
